#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+PROPERTY: header-args:python :session *l5*
#+PROPERTY: header-args:python+ :exports both
#+PROPERTY: header-args:python+ :tangle yes

#+begin_src elisp :exports none
(setq-local org-image-actual-width '(1024))
(setq-local org-html-htmlize-output-type 'css)
(setq-local org-latex-listings 'minted)
#+end_src

#+RESULTS:
: minted

* Загрузка данных
#+begin_src python :display plain
from IPython.display import display
from matplotlib import pyplot as plt
import matplotlib as mpl
import pandas as pd
import numpy as np
import tabulate

mpl.rcParams['figure.dpi'] = 200
mpl.rcParams['figure.facecolor'] = '1'

tabulate._table_formats['booktabs_raw'] = tabulate._table_formats['latex_booktabs']._replace(**{
        'headerrow': tabulate._table_formats['latex_raw'].headerrow,
        'datarow': tabulate._table_formats['latex_raw'].datarow,
    })

data = pd.read_csv('../data/iris.data', header=None)

with open('./output/data.txt', 'w') as f:
    f.write(str(data))

data
#+end_src

#+RESULTS:
#+begin_example
         0    1    2    3               4
  0    5.1  3.5  1.4  0.2     Iris-setosa
  1    4.9  3.0  1.4  0.2     Iris-setosa
  2    4.7  3.2  1.3  0.2     Iris-setosa
  3    4.6  3.1  1.5  0.2     Iris-setosa
  4    5.0  3.6  1.4  0.2     Iris-setosa
  ..   ...  ...  ...  ...             ...
  145  6.7  3.0  5.2  2.3  Iris-virginica
  146  6.3  2.5  5.0  1.9  Iris-virginica
  147  6.5  3.0  5.2  2.0  Iris-virginica
  148  6.2  3.4  5.4  2.3  Iris-virginica
  149  5.9  3.0  5.1  1.8  Iris-virginica

  [150 rows x 5 columns]
#+end_example

#+begin_src python :display plain
no_labeled_data = data.drop(4, axis=1)
no_labeled_data
#+end_src

#+RESULTS:
#+begin_example
         0    1    2    3
  0    5.1  3.5  1.4  0.2
  1    4.9  3.0  1.4  0.2
  2    4.7  3.2  1.3  0.2
  3    4.6  3.1  1.5  0.2
  4    5.0  3.6  1.4  0.2
  ..   ...  ...  ...  ...
  145  6.7  3.0  5.2  2.3
  146  6.3  2.5  5.0  1.9
  147  6.5  3.0  5.2  2.0
  148  6.2  3.4  5.4  2.3
  149  5.9  3.0  5.1  1.8

  [150 rows x 4 columns]
#+end_example

* Иерархическая кластеризация
#+begin_src python
from sklearn.cluster import AgglomerativeClustering

hier = AgglomerativeClustering(n_clusters=3, linkage='average')
hier = hier.fit(no_labeled_data)
hier_labels = hier.labels_

display(hier_labels)
#+end_src

#+RESULTS:
: array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
:        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
:        1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
:        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
:        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 2, 2, 2, 2, 0, 2, 2, 2,
:        2, 2, 2, 0, 0, 2, 2, 2, 2, 0, 2, 0, 2, 0, 2, 2, 0, 0, 2, 2, 2, 2,
:        2, 0, 2, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 2, 0, 2, 2, 0])

* Кольца
#+begin_src python
import random
import math
data1 = np.zeros([250,2])
for i in range(250):
    r = random.uniform(1, 3)
    a = random.uniform(0, 2 * math.pi)
    data1[i,0] = r * math.sin(a)
    data1[i,1] = r * math.cos(a)

data2 = np.zeros([500,2])
for i in range(500):
    r = random.uniform(5, 9)
    a = random.uniform(0, 2 * math.pi)
    data2[i,0] = r * math.sin(a)
    data2[i,1] = r * math.cos(a)

data = np.vstack((data1, data2))

display(data)
#+end_src

#+RESULTS:
: array([[-0.54729402, -1.14268356],
:        [-1.32483991,  1.21099134],
:        [ 1.76587619,  2.22396402],
:        ...,
:        [-2.71247103, -4.43659556],
:        [-2.2925305 , -7.22401915],
:        [ 4.97533705,  4.05580533]])

